#include <iostream>
using namespace std;

int main() {
    setlocale(0, ".1251");
    int a, b;

    cout << "Введіть число a (ціле): ";
    cin >> a;
    cout << "Введіть число b (ціле): ";
    cin >> b;

    cout << "Адреса першої змінної: " << &a << endl;
    cout << "Адреса другої змінної: " << &b << endl;

    cout << "Значення від а до b: ";

    for (int i = a; i <= b; i++) {
        cout << "-" << i << " ";
    }

    return 0;
}
//Користувач вводить ціле число в першу і другу змінну, 
//в циклі один раз виводяться адреси цих змінних, 
//потім виводяться значення від першої до другої змінної, 
//але тільки зі знаком мінус.